In [1]:
import pandas as pd
from sklearn.tree import DecisionTreeClassifier

In [2]:
train = pd.read_csv('./data/train.csv')
test = pd.read_csv('./data/test.csv')

In [3]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [45]:
tabela_1 = pd.read_csv('my_submission.csv')
tabela_2 = pd.read_csv('submission2.csv')

In [46]:
tabela_1.head()

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

In [7]:
tabela_2.head()

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

In [8]:
m = pd.merge(tabela_1, tabela_2, how = 'inner', on = 'PassengerId')

In [9]:
m.head()

   PassengerId  Survived_x  Survived_y
0          892           0           0
1          893           1           1
2          894           0           0
3          895           0           0
4          896           1           1

In [10]:
m['Survived_x'].sum()

148

In [11]:
m['Survived_y'].sum()

150

In [12]:
m['diferenca'] = m['Survived_x'] - m['Survived_y']

In [13]:
m.head()

   PassengerId  Survived_x  Survived_y  diferenca
0          892           0           0          0
1          893           1           1          0
2          894           0           0          0
3          895           0           0          0
4          896           1           1          0

In [14]:
novo_df = m['diferenca'] != 0

In [16]:
filtrado = m[novo_df]

In [17]:
filtrado.head()

     PassengerId  Survived_x  Survived_y  diferenca
32           924           0           1         -1
64           956           1           0          1
80           972           0           1         -1
89           981           0           1         -1
142         1034           1           0          1

In [18]:
len(filtrado)

16

In [19]:
filtrado['Survived_y'].sum()

9

In [82]:
resultado = tabela_1.copy()

In [77]:
resultado.loc[tabela_1['Survived'] < tabela_2['Survived'], 'Survived'] = tabela_2['Survived']

In [79]:
resultado.to_csv('submission.csv', index=False)

0.77751

In [83]:
resultado = tabela_1.copy()

In [84]:
resultado.loc[tabela_1['Survived'] > tabela_2['Survived'], 'Survived'] = tabela_1['Survived']

In [85]:
resultado.to_csv('submission.csv', index=False)